SELECT 5 AS SystemTaskType_id,
		[Складское подразделение] AS ZoneShipper,
		LEFT([Складское место], INSTR([Складское место], '.') - 1) AS RowShipper,
		[Склад-получ#] AS ZoneConsignee,
		[Тип задачи пользователя] AS UserTaskType,
		[Работник] AS Employee,
		MIN([Время загрузки]) AS LoadTime
FROM [{table}]
WHERE [Тип задачи системы] = 'Отбор' AND [План/задача] = 'Независимая задача' AND [Тип задачи пользователя] IS NOT NULL
GROUP BY [Заголовок источника], [Номер строки], [Позиция], [Складское подразделение], [Складское место], [Склад-получ#], [СМ-получатель], [Тип задачи пользователя], [Работник], [Назначенное время]

UNION ALL

SELECT 5 AS SystemTaskType_id,
		[Складское подразделение] AS ZoneShipper,
		LEFT([Складское место], INSTR([Складское место], '.') - 1) AS RowShipper,
		[Склад-получ#] AS ZoneConsignee,
		[Тип задачи пользователя] AS UserTaskType,
		[Работник] AS Employee,
		MIN([Время загрузки]) AS LoadTime
FROM [{table}]
WHERE [Тип задачи системы] = 'Отбор' AND [План/задача] = 'Дочерняя задача' AND [Тип задачи пользователя] IS NOT NULL
GROUP BY [Позиция], [Складское подразделение], [Складское место], [Склад-получ#], [СМ-получатель], [Тип задачи пользователя], [Работник], [Назначенное время]